df_Abus$Diagnosis <- factor(df_Abus$Diagnosis, 
                            levels=c(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10),
                            labels = c(
  "0"="Без патологии",
  "1"="Рак",
  "2"="Саркома",
  "3"="Фиброаденома", 
  "4"="Фиброзно-кистозная болезнь",
  "5"="Киста",
  "6"="Листовидная опухоль",
  "7"="Внутрипротоковая папиллома",
  "8"= "Гиперплазия",
  "9"= "Диффузный фиброаденоматоз",
  "10"="Локализованный фиброаденоматоз"
  ))


df_Abus$Satus_reproductive	<- factor(df_Abus$Side, 
                                     levels=c(1, 2, 3, 4,5,6),
                                     labels = c(
                                       "1"="репродуктивный возраст",
                                       "2"="менопауза до 5 лет",
                                       "3"="менопауза > 5 лет",
                                       "4"="пременопауза",
                                       "5"="оперативная менопауза",
                                       "6"="беременность"
                                     ))
                                       



df_Abus$Сomplaints<- factor(df_Abus$Side, 
                            levels=c(1, 2, 3, 4, 5, 6,7),
                            labels = c(
                              "1"= "нет",
                              "2"= "есть опухоль",
                              "3"= "выделения из соска",
                              "4"= "боль",
                              "5"= "уплотнение",
                              "6"= "гиперемия",
                              "7"= "гипертермия"
                            ))
                              




df_Abus$Side <- factor(df_Abus$Side, 
                       levels=c(1, 2, 3, 4),
                       labels = c(
  "1"="правая",
  "2"="левая",
  "3"="обе",
  "4"="не пальпируются"
))
  


df_Abus$Breast_Surgery_before <- factor(df_Abus$Breast_Surgery_before  , 
                                        levels=c(1, 2),
                                        labels = c(
                                          "1"="Не было операций",
                                          "2"="Были операции"
                                          ))
