library(lubridate)
for (i in seq(from=1,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2023", "2022")
}

for (i in seq(from=2,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2023", "2021")
}

for (i in seq(from=3,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2023", "2020")
}


for (i in seq(from=1,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2022", "2019")
}

for (i in seq(from=1,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2022", "2020")
}

for (i in seq(from=1,to=length(dfXlsx$date_examination),by=3)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2022", "2021")
}

for (i in 1:length(dfXlsx$date_examination)){
  dfXlsx$date_examination[i] <- str_replace(dfXlsx$date_examination[i], "2018", "2021")
}

dfXlsx$date_examination <- as.Date(dfXlsx$date_examination, format = "%d %m %Y")

table(year(dfXlsx$date_examination))

colnames(dfXlsx) <- 
  c("id пациента",
    "карта пациента",
    "дата обследования",
    "группа",
    "возраст",
    "первичный дигноз",
    "сторона",
    "репродуктивный статус",
    "жалобы",
    "операции на молочной железе",
    "кожный симптомы",
    "симптом ретракции соска",
    "выделения из соска",
    "квадрант",
    "наследственность",
    "прием гормональных препаратов",
    "рост пациента",
    "вес пациента",
    "кожа при УЗИ",
    "контур образования при УЗИ",	
    "протоки при УЗИ",	
    "фон при УЗИ",	
    "локализация образования при УЗИ",	
    "форма образования при УЗИ",	
    "размер образования при УЗИ",	
    "эхогенность образования при УЗИ",
    "структура образования при УЗИ",	
    "кровоток в образовании при УЗИ",
    "эластография при УЗИ",
    "регинарные лимфоузлы при УЗИ",
    "УЗИ диагноз",
    "время выполнения УЗИ",
    "доктор выполняыший УЗИ",
    "количесто образований УЗИ",
    "категория BIRADS УЗИ",
    "кожа при ММГ",
    "ареола ММГ",
    "соск ММГ",
    "фон ММГ",
    "образование ММГ",
    "контур образования ММГ",
    "размер образования ММГ",
    "кальцинаты ММГ",
    "количество визуализируемых образований ММГ",
    "подмышечные лимфоузлы ММГ",
    "заключение ММГ",
    "тип структуры ACR",
    "количество узлов ММГ",
    "категория BIRADS ММГ",
    "калльцинаты micro pure УЗИ",
    "кожа ABUS",
    "размер узлов ABUS",
    "контур узлов ABUS",
    "эхогенность образования ABUS",
    "структура образования ABUS",
    "симптом ретрации ABUS",
    "диагноз ABUS",
    "время выполнения ABUS",
    "локализация образования ABUS",
    "количество узлов ABUS",
    "категория BIRADS ABUS",
    "кальцинаты ABUS",
    "МРТ данные",
    "МРТ количество узлов",
    "морфологическая структура образования",
    "цитологическое заключение",
    "уровень злокачественности",
    "мутация brca",
    "рецепторы опухоли",
    "выполняли ММГ",
    "выполняли ABUS",
    "выполняли МРТ",
    "выполняли морфологию",
    "выполняли цитологию",
    "определнный уровень злокачественности",
    "определены рецепторы",
    "УЗИ есть образование",
    "ABUS есть образование",
    "ММГ есть образование",
    "ММГ есть кальцинат",
    "УЗИ есть кальцинат",	
    "ABUS есть кальцинат",	
    "ММГ есть микрокальцинат",	
    "УЗИ есть микрокальцинат",	
    "ABUS есть микрокальцинат",	
    "УЗИ определил опухоль",	
    "ММГ определил опухоль",	
    "ABUS определил опухоль",	
    "опухоль по гистологии",	
    "УЗИ веротность определния кальцината",	
    "УЗИ веротность определния микрокальцината",	
    "ABUS веротность определния кальцината",	
    "ABUS веротность определния микрокальцината",	
    "УЗИ веротность определния рака",	
    "ABUS веротность определния рака",	
    "ММГ веротность определния рака")

write.xlsx(dfXlsx, "./outputdata/native_data.xlsx")



